t = True
lang = ['Повернул налево', 'Шаг вперед', 'Повернул направо' ]
ans = ['Да','Нет']
result = ['+-----+---------------------+-------------------+-----------------+-----------------------+-----------------+','| Шаг | Вышли из лабиринта? | Слева есть стена? |   Действие      | Можно шагнуть вперед? |   Действие      |','+-----+---------------------+-------------------+------------+-----------------------+------------+']
i = 1

while t ==True:
    if ans[0]==input('Закончим? ').title():
        break
    if ans[0]== input('Вышли из лабиринта? ').title():
        result.append(f'| {i}  |            Да       |                   |                 |                       |                 |')
        result.append('+-----+---------------------+-------------------+-----------------+-----------------------+-----------------+')
        break
    dest1, dest2 = input('Слева есть стена? ').title(), input('Можно шагнуть вперед? ').title()
    if dest1 == ans[0] and dest2 == ans[1]:
        result.append(f'| {i}  |           Нет       |         Да        |         -       |         Нет           | {lang[2]}|')
    elif dest1 == ans[0] and dest2 == ans [0]:
        result.append(f'| {i}  |           Нет       |         Да        |         -       |         Да            |   {lang[1]}    |')
    elif dest1 == ans[1] and dest2 == ans [0]:
        result.append(f'| {i}  |           Нет       |         Нет       | {lang[0]} |         Да            |   {lang[1]}    |')
    else:
        result.append(f'| {i}  |           Нет       |         Нет       | {lang[0]} |         Нет           |         -       |')
    result.append('+-----+---------------------+-------------------+-----------------+-----------------------+-----------------+')
    i+=1
with open('C:/Users/andre_33ifa79/Downloads/project_4/task_4-5/task_4-5-1.txt','a',encoding='utf-8') as f:
    for i in result:
        f.write('\n'+i)



